{
  "project": "HeyDev",
  "branchName": "main",
  "description": "Fix HeyDev Production - Run database migration, verify all user flows, enable dogfooding",
  "userStories": [
    {
      "id": "US-001",
      "title": "Run database migration on production",
      "description": "As an operator, I need to run migration 0003 on production to add setup_step and setup_completed_at columns.",
      "acceptanceCriteria": [
        "SSH into production server: ssh -i ~/.ssh/eapen-coolify.txt cloud@172.252.211.242",
        "Find and navigate to the HeyDev server directory",
        "Run npm run db:migrate to apply migration 0003",
        "Verify migration completes without error",
        "Verify columns exist by checking database schema or running a test query"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Server IP: 172.252.211.242, SSH key: ~/.ssh/eapen-coolify.txt. Migration ran manually by applying SQL directly since drizzle-kit was not available in production container."
    },
    {
      "id": "US-002",
      "title": "Verify login flow works after migration",
      "description": "As a user, I want to be able to log in without seeing JSON parsing errors.",
      "acceptanceCriteria": [
        "Navigate to https://heydev.io/login using dev-browser skill",
        "Verify 'Welcome back' heading is visible",
        "Verify 'New to HeyDev? Sign up free' link is visible",
        "Enter a test email address",
        "Click 'Send Magic Link' button",
        "Verify no JSON parsing error appears (no red error box with 'Unexpected token')",
        "Verify 'Check your email' success message appears OR a proper error message if email fails"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Verified: Login page displays correctly, API returns proper JSON response. Error 'Failed to send magic link email' is expected for test domains (email service rejects them). No JSON parsing errors."
    },
    {
      "id": "US-003",
      "title": "Verify landing page signup flow",
      "description": "As a new user, I want to sign up from the landing page.",
      "acceptanceCriteria": [
        "Navigate to https://heydev.io using dev-browser skill",
        "Verify 'Get Started Free' CTA button in hero section",
        "Verify 'Log In' link in header",
        "Scroll to signup section",
        "Verify 'Start collecting feedback today' heading",
        "Enter a test email and submit",
        "Verify magic link request succeeds (no errors)"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Verified: Landing page displays correctly with hero CTA, Log In link, and signup form. API returns proper JSON response. Error 'Failed to send magic link email' is expected for test domains (email service rejects them). No JSON parsing errors."
    },
    {
      "id": "US-004",
      "title": "Verify setup wizard appears for new users",
      "description": "As a new user who clicks a magic link, I should see the setup wizard.",
      "acceptanceCriteria": [
        "After magic link verification, user should be redirected to /setup?step=1",
        "Verify 'Step 1 of 4' indicator is visible",
        "Verify 'Generate Your API Key' heading is visible",
        "Verify 'Generate API Key' button is present",
        "Click button and verify API key is generated and displayed",
        "Verify 'Copy' button works",
        "Verify 'Continue' button is enabled after key generation"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Verified: Setup wizard step 1 works correctly. Created test session for user 1, navigated to /setup?step=1, verified all UI elements. API key generated (hd_live_b28320633d3c89ca477a2373e8363912), Copy button works, Continue button enabled after generation."
    },
    {
      "id": "US-005",
      "title": "Verify setup wizard steps 2-4 work",
      "description": "As a new user, I want to complete the full setup wizard.",
      "acceptanceCriteria": [
        "Step 2: Verify 'Install the Widget' heading",
        "Step 2: Verify code snippet shows with API key pre-filled",
        "Step 2: Verify Copy button works",
        "Step 3: Verify 'Get Notified' heading with 'Optional' subtext",
        "Step 3: Verify Email and Webhook toggle cards",
        "Step 3: Verify 'Skip for now' link works",
        "Step 4: Verify 'Test Your Integration' heading",
        "Step 4: Verify URL input field and 'Open Test Page' button",
        "Step 4: Verify 'Skip test' link navigates to inbox",
        "After completing wizard, verify redirect to /inbox",
        "Verify header shows: Inbox, Settings, Log out"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Verified: All wizard steps work correctly. Step 2 shows Install Widget with API key pre-filled and working Copy button. Step 3 shows Get Notified with Optional subtext, Email/Webhook toggles, and Skip for now link. Step 4 shows Test Your Integration with URL input, Open Test Page button, and Skip test link. Skip test navigates to /inbox. After reload, header shows Inbox, Settings, Log out."
    },
    {
      "id": "US-006",
      "title": "Verify returning user flow (setup complete)",
      "description": "As a returning user who completed setup, I should go directly to inbox.",
      "acceptanceCriteria": [
        "Login with email of user who has completed setup (setupCompletedAt is set)",
        "After clicking magic link, verify redirect goes to /inbox (NOT /setup)",
        "Verify header shows full navigation: Inbox (with badge), Settings, Log out",
        "Verify clicking Settings goes to /setup which shows settings view (not wizard)"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Verified: Created session for test@example.com (user 1, setupCompletedAt set). Navigating to /inbox shows Feedback Inbox with full nav (Inbox, Settings, Log out). Clicking Settings navigates to /setup which shows Settings view with API Key section, Widget snippet, and Notification Channels (not the setup wizard). Badge on Inbox only appears with unread feedback."
    },
    {
      "id": "US-007",
      "title": "Enable HeyDev dogfooding",
      "description": "As a product, HeyDev should use HeyDev for feedback and error tracking.",
      "acceptanceCriteria": [
        "Generate an API key for HeyDev's own account (or use existing)",
        "Set VITE_HEYDEV_API_KEY environment variable in Coolify dashboard build settings",
        "Redeploy the dashboard",
        "Verify HeyDev widget appears on heydev.io pages",
        "Submit a test feedback to verify widget works",
        "Verify feedback appears in HeyDev's own inbox"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Widget code is already in App.tsx, just needs the env var set"
    }
  ]
}
